/********************************************************************************
 * 1. Permutation: visited数组的使用
 * 2. Combination: backtrack按顺序访问; 如果需要考虑重复问题时，Arrays.sort() 用先排序
 * 3. Subset: backtrack按顺序访问, 如果需要考虑重复问题时，Arrays.sort() 用先排序
 * 
 * 重点题型：Le_22*, *47, 52, **60, 77, 78, 79, *89, **93, *131, *139, **140, 211, 
 * 		   **212, 216, **254, **267, 294, **351, *357, 
 * 
 *   (1). Permutations: **31, 46, *47, **60
 *   (2). Combination: 39, 40, 216, 77 
 *   (3). Subset: 78, 90, 
 *   (4). N-Queens: 51, 52  
 *   (5). 字符串切割: *131, *132, 时间复杂度优化，则考虑用DP, 如*139, **140, 
 *   (6). Trie: 211 (含有"."的情况), **212 (矩阵中寻找单词) 
 *   (7). Palindrome: **267, 
 *   
 *********************************************************************************/

public class Datastructure {

}
